;; (setq settings_path "/home/honnisha/Projects/emacs_settings/")
;; (setq dropbox_path "/home/honnisha/Dropbox/")
;; (load-file (concat settings_path "packages.el"))

(package! back-button :recipe (:host github :repo "rolandwalker/back-button"))
(package! tree-sitter-langs)
(package! tree-sitter)
(package! highlight-symbol :recipe (:host github :repo "nschum/highlight-symbol.el"))
(package! winum :recipe (:host github :repo "deb0ch/emacs-winum"))
(package! flycheck)
(package! lsp-pyright)
(package! virtualenvwrapper)
(package! lsp-ui)
(package! undo-tree)
(package! all-the-icons-ivy)
(package! restclient)
(package! py-isort)
(package! emmet-mode)
(package! python-pylint)
(package! lsp-java)
(package! centaur-tabs :recipe (:host github :repo "ema2159/centaur-tabs"))

(when (package! ivy)
  (package! ivy-rich))

(package! multi-term)
(package! dashboard)
(package! page-break-lines)
(package! expand-region)
(package! company-lsp)
(package! company-quickhelp)
(package! reverse-im)
