(package! back-button :recipe (:host github :repo "rolandwalker/back-button"))
(package! tree-sitter)
(package! tree-sitter-langs)
(package! highlight-symbol :recipe (:host github :repo "nschum/highlight-symbol.el"))
(package! winum :recipe (:host github :repo "deb0ch/emacs-winum"))
(package! flycheck)
(package! virtualenvwrapper)
(package! undo-tree)
(package! restclient)
(package! py-isort)
(package! emmet-mode)
(package! rust-mode)
(package! flycheck-rust)
(package! rg)
(package! centaur-tabs :recipe (:host github :repo "ema2159/centaur-tabs"))

(package! ivy :disable t)
(package! helm :disable t)
(package! ido :disable t)

(package! vertico)
(package! all-the-icons-completion)
(package! consult)
(package! marginalia)
(package! embark)
(package! orderless)

(package! lsp-mode)
(package! lsp-ui)
(package! lsp-pyright)

(package! company)
(package! company-quickhelp)

;; (package! lsp-ui :disable t)
;; (package! lsp-mode :disable t)
;; (package! lsp-bridge :recipe (:host github :repo "manateelazycat/lsp-bridge"))
;; (package! posframe :recipe (:host github :repo "tumashu/posframe"))
;; (package! markdown-mode :recipe (:host github :repo "jrblevin/markdown-mode"))
;; (package! yasnippet :recipe (:host github :repo "joaotavora/yasnippet"))
;; (package! popon)
;; (package! acm-terminal :recipe (:host github :repo "twlz0ne/acm-terminal"))

(package! python-pylint)
(package! lsp-java)

(package! multi-term)
(package! dashboard)
(package! page-break-lines)
(package! expand-region)
(package! reverse-im)
(package! smartparens)
(package! highlight-indent-guides)
(package! undo-tree)
(package! yascroll :recipe (:host github :repo "emacsorphanage/yascroll"))
(package! flyspell-correct)
(package! python-black)
(package! emacs-w3m)
(package! origami)
(package! atomic-chrome)
(package! lua-mode)
